Repository: interact-rg/PoliisiautoApp
Catalog: lib/l10n/app_*.arb
Languages: fi

# aboutApp
source: About the application
fi: Tietoa sovelluksesta

source: Addressed
fi: Osoitetut

source: All
fi: Kaikki

source: Alright
fi: Selvä

source: Anonymous
fi: Nimetön

source: Author
fi: Ilmoittaja

# bulliedPerson
source: The person being bullied was someone other than me
fi: Kiusattu oli joku muu kuin minä

source: Bully
fi: Kiusaaja

source: Cancel
fi: Peruuta

# checkEmailAndPassword
source: Make sure you typed the email and password correctly.
fi: Varmista että kirjoitit sähköpostin ja salasanan oikein.

source: Created by me
fi: Minun luomat

# disengageFromSituation
source: If possible, try to disengage from the situation.
fi: Jos mahdollista, yritä irtautua tilanteesta.

source: Email
fi: Sähköposti

# emergencyInfo
source: When you make an emergency report, the nearest Adults will receive a notification showing your name, location and other information.
fi: Kun teet hätäilmoituksen, lähimmät aikuiset saavat ilmoituksen, jossa näkyy nimesi, sijaintisi ja muuta tietoa.

# emergencyIsSendAdult
source: An emergency notification has been sent to the nearest adults
fi: Hätäilmoitus on lähetetty lähimmille aikuisille

# emergencyNotification
source: Are you sure you want to send an emergency notification?
fi: Oletko varma että haluat lähettää hätäilmoituksen?

# emergencyReport
source: Make an emergency report
fi: Tee hätäilmoitus

# en
source: English
fi: Englanti

# fi
source: Finnish
fi: Suomi

# findAdult
source: Find an adult nearby, such as a teacher or school counselor.
fi: Etsi läheltäsi aikuinen, kuten opettaja tai koulukuraattori.

source: Forgot password?
fi: Unohditko salasanasi?

source: Front page
fi: Etusivu

# giveEmail
source: Give email address
fi: Anna sähköpostiosoite

source: Give password
fi: Anna salasana

source: Help
fi: Apua

# helpInfoText
source: The organization's own links and other content can be searched for on this page.
fi: Tälle sivulle voidaan hakea organisaation omia linkkejä, sekä muuta sisältöä.

source: Help pages
fi: Apusivut

source: Hi
fi: Hei

# homePagePlaceholder
source: This includes, for example, organization-specific content, which can change daily.
fi: Tähän tulee esimerkiksi organisaatiokohtaista sisältöä, joka voi muuttua päivittäin.

# infoText
source: Poliisiauto is an application designed by school children through which kids can report bullying to a trusted adult and adults can handle bullying cases. The source code of the application is open.
fi: Poliisiauto on koululaisten ideoima sovellus, jonka kautta lapset voivat ilmoittaa kiusaamisesta luotettavalle aikuiselle ja aikuiset pystyvät käsittelemään kiusaamistapauksia. Sovelluksen lähdekoodi on avoin.

source: Language
fi: Kieli

source: Login failed!
fi: Kirjautuminen epäonnistui!

source: Log out
fi: Kirjaudu ulos

# makeReport
source: Make a report
fi: Tee ilmoitus

source: Message content
fi: Viestin sisältö

source: Messages
fi: Viestit

# myNotifications
source: My reports
fi: Minun ilmoitukset

source: My settings
fi: Minun asetukset

source: No description
fi: Ei kuvausta

# noName
source: I don't want the teacher to know my name
fi: En halua että opettaja tietää nimeni

source: Not reported
fi: Ei ilmoitettu

# notifications
source: Reports
fi: Ilmoitukset

source: Organization
fi: Organisaatio

# pageHomeTitle
source: Welcome, {userName}
fi: Tervetuloa, {userName}

source: Password
fi: Salasana

# reportDescription
source: Description of the report
fi: Ilmoituksen kuvaus

source: Report information
fi: Ilmoituksen tiedot

source: Send
fi: Lähetä

source: Send message
fi: Lähetä viesti

# sendNotificationWho
source: Who do you want to send the notification to?
fi: Kenelle haluat lähettää ilmoituksen?

# sendVideoImage
source: Send a video image
fi: Lähetä videokuvaa

# sendVoiceMessage
source: Send a voice message
fi: Lähetä ääniviesti

# sendingEmergencyNotification
source: Sending an emergency notification
fi: Lähetetään hätäilmoitusta

source: Settings
fi: Asetukset

source: Sign in
fi: Kirjaudu sisään

source: spring
fi: kevät

source: Stop sending
fi: Lopeta lähetys

# sure
source: I'm sure
fi: Olen varma

# tellWhatHappened
source: Tell in your own words what happened
fi: Kerro omin sanoin mitä tapahtui

source: Thanks
fi: Kiitokset

# victim
source: Victim of bullying
fi: Kiusattu

source: What happened?
fi: Mitä tapahtui?

# whoBullied
source: Who bullied? (optional)
fi: Kuka kiusasi? (valinnainen)

# whoWasBullied
source: Who was bullied? (optional)
fi: Ketä kiusattiin? (valinnainen)

# writeMessage
source: Write a message
fi: Kirjoita viesti

source: You
fi: Sinä
